{
  "content": [
    {
      "section": "",
      "paragraphs": [
        "Read the following carefully and ensure you understand the obligations and conditions of the internship before proceeding with your application."
      ]
    },
    {
      "section": "Objective of the Internship",
      "paragraphs": [
        "The internship is designed to provide practical real world experience and exposure to the inner workings of the EAC and its organs. It offers an opportunity for professional development to students through hands-on tasks and interactions with experienced professionals ."
      ]
    },
    {
      "section": "Eligibility Requirements",
      "paragraphs": [
        "You must be enrolled in a recognized university or have recently graduated (within the last year) in any of the EAC member states' higher education learning institutions",
        "Internships are available for students in fields related to the work and supporting activities of the EAC, such as Information Technology, Human Resources, Finance, Customs and Trade, Public Relations and Communications, International Relations & Diplomacy etc."
      ]
    },
    {
      "section": "Internship Duration and Scope",
      "paragraphs": [
        "The internship program typically lasts between 2 to 6 months, depending on the requirements of your academic program or department and interns will be assigned to specific departments based on their skills, interests, and the needs of the organization.",
        "The intern is expected to complete the full duration unless otherwise stated."
      ]
    },
    {
      "section": "Transportation and Upkeep",
      "paragraphs": [
        "You are responsible for your transportation costs to and from the EAC offices throughout the internship. The EAC does not provide any housing, transportation allowances, or financial support for daily expenses."
      ]
    },
    {
      "section": "Medical Insurance",
      "paragraphs": [
        "It is mandatory for all interns to have valid medical insurance coverage for the entire duration of the internship. You will be required to present updated proof of medical insurance on the first day of reporting to duty."
      ]
    },
    {
      "section": "Personal Conduct and Responsibilities",
      "paragraphs": [
        "Interns are expected to maintain a professional attitude and abide by the organizational rules and regulations as detailed in the official EAC Staff Rules and Regulations Handbook. You must adhere to the working hours of the assigned department and fulfill your tasks diligently.",
        "You are required to respect the confidentiality of all information you encounter during the internship and will be obligated to sign a confidentiality agreement before starting the internship in this regard."
      ]
    },
    {
      "section": "Absences and Leave",
      "paragraphs": [
        "Absences must be reported to your supervisor in advance. Leave during the internship period will only be granted in exceptional cases subject to prior approval from the supervisor."
      ]
    },
    {
      "section": "Termination of Internship",
      "paragraphs": [
        "The EAC reserves the right to terminate the internship for unsatisfactory performance or violation of EAC policies. Interns may also terminate the internship voluntarily by providing at least two weeks' notice."
      ]
    },
    {
      "section": "Certification",
      "paragraphs": [
        "Upon successful completion of the internship, the intern will receive a certificate of completion from the EAC."
      ]
    }
  ]
}
